---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOldCornerMullion
source: html/0d737f0d-a55e-b04f-f0bd-0faa608f8031.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOldCornerMullion Property

Cannot change the type of a mullion created prior to release 4.0 to a corner mullion type. Try deleting the existing mullion and placing a new one.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateOldCornerMullion { get; }
```